balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F86J16.PIC
          <edc:SFRDef edc:access="n-nnnnnn" edc:cname="PMCONH" edc:desc="" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="PMCONH" edc:nzwidth="0x8" edc:por="0-000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PTRDEN" edc:desc="" edc:mask="0x1" edc:name="PTRDEN" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PTWREN" edc:desc="" edc:mask="0x1" edc:name="PTWREN" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PTBEEN" edc:desc="" edc:mask="0x1" edc:name="PTBEEN" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRMUX0" edc:desc="" edc:mask="0x1" edc:name="ADRMUX0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRMUX1" edc:desc="" edc:mask="0x1" edc:name="ADRMUX1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PSIDL" edc:desc="" edc:mask="0x1" edc:name="PSIDL" edc:nzwidth="0x1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:SFRFieldDef edc:cname="PMPEN" edc:desc="" edc:mask="0x1" edc:name="PMPEN" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PMDIN1" edc:desc="" edc:name="PMDIN1" edc:nzwidth="0x10">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMDIN1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PMDIN1L" edc:nzwidth="0x8" edc:por="00000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DATAL" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="DATAL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMDIN1H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PMDIN1H" edc:nzwidth="0x8" edc:por="00000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DATAH" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="DATAH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PMADDR" edc:desc="" edc:name="PMADDR" edc:nzwidth="0x10">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PMDOUT1"/>
          </edc:AliasList>
          <edc:SFRModeList/>
          <edc:MuxedSFRDef edc:nzwidth="8">
            <edc:SelectSFR>
              <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMADDRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PMADDRL" edc:nzwidth="0x8" edc:por="00000000">
                <edc:AliasList/>
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="ADDRL" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="ADDRL" edc:nzwidth="0x8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="IDE.0" edc:when="# qbit: PMADDR is used in master mode, PMDOUT1 in slave mode">
                    <edc:SFRFieldDef edc:cname="DATAOUT1L" edc:desc="" edc:mask="0xff" edc:name="DATAOUT1L" edc:nzwidth="0x8"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
                <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
              </edc:SFRDef>
            </edc:SelectSFR>
            <edc:SelectSFR>
              <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMDOUT1L" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PMDOUT1L" edc:nzwidth="8" edc:por="00000000">
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="PMDOUT1L" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="PMDOUT1L" edc:nzwidth="8"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
          </edc:MuxedSFRDef>
          <edc:MuxedSFRDef edc:nzwidth="8">
            <edc:SelectSFR>
              <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMADDRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PMADDRH" edc:nzwidth="0x8" edc:por="00000000">
                <edc:AliasList/>
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="ADDRH" edc:desc="" edc:mask="0x3f" edc:name="ADDRH" edc:nzwidth="0x6"/>
                    <edc:SFRFieldDef edc:cname="CS1" edc:desc="" edc:mask="0x1" edc:name="CS1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CS2" edc:desc="" edc:mask="0x1" edc:name="CS2" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="IDE.0" edc:when="# qbit: PMADDR is used in master mode, PMDOUT1 in slave mode">
                    <edc:SFRFieldDef edc:cname="DATAOUT1H" edc:desc="" edc:mask="0xff" edc:name="DATAOUT1H" edc:nzwidth="0x8"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
                <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
              </edc:SFRDef>
            </edc:SelectSFR>
            <edc:SelectSFR>
              <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMDOUT1H" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PMDOUT1H" edc:nzwidth="8" edc:por="00000000">
                <edc:AliasList/>
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="PMDOUT1H" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="PMDOUT1H" edc:nzwidth="8"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
          </edc:MuxedSFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="------rr" edc:cname="CMSTAT" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------11" edc:name="CMSTAT" edc:nzwidth="0x8" edc:por="------11">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CMSTATUS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="COUT1" edc:desc="" edc:mask="0x1" edc:name="COUT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COUT2" edc:desc="" edc:mask="0x1" edc:name="COUT2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
